'''Створіть граф за допомогою бібліотеки networkX для моделювання певної реальної мережі
(наприклад, транспортної мережі міста, соціальної мережі, інтернет-топології).
info
📖 Реальну мережу можна вибрати на свій розсуд, якщо немає можливості придумати
свою мережу, наближену до реальності.

Візуалізуйте створений граф, проведіть аналіз основних характеристик (наприклад, кількість
вершин та ребер, ступінь вершин).'''

import networkx as nx
import matplotlib.pyplot as plt

# Creating
my_graph = nx.Graph()
my_graph.add_nodes_from(['A', 'B', 'C', 'D', 'E'])
my_graph.add_edges_from([('A', 'B'), ('A', 'C'), ('C', 'B'), ('C', 'D'), ('C', 'E'), ('E', 'D')])

# Visualisation
visual = nx.spring_layout(my_graph, seed=42)
nx.draw(my_graph, visual)

plt.show()
